In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

Load dataset first

In [2]:
address = pd.read_csv("Employee_Addresses.csv")
stops = pd.read_csv("Potentail_Bust_Stops.csv")

In [3]:
print("Address table")
display(address.head(3))
print("stops table")
display(stops.head(3))

Address table

                                         address  employee_id
0  98 Edinburgh St, San Francisco, CA 94112, USA          206
1       237 Accacia St, Daly City, CA 94014, USA         2081
2   1835 Folsom St, San Francisco, CA 94103, USA          178

stops table

   Street_One         Street_Two
0  MISSION ST          ITALY AVE
1  MISSION ST  NEW MONTGOMERY ST
2  MISSION ST            01ST ST

In [4]:
print("There are {} employees".format(len(address['employee_id'].unique())))
print("There are {} street conjunctions".format(len(stops)))

There are 2191 employees
There are 119 street conjunctions

Assumptions